badenwork/hal_nuvoton/dts/pinctrl/m2354sjfae-pinctrl.h
#define PB10MFP_BPWM1_CH1		NVT_PINMUX('B', 10, SYS_GPB_MFPH_PB10MFP_BPWM1_CH1)
#define PB10MFP_SPI3_SS		NVT_PINMUX('B', 10, SYS_GPB_MFPH_PB10MFP_SPI3_SS)
#define PB11MFP_GPIO		NVT_PINMUX('B', 11, SYS_GPB_MFPH_PB11MFP_GPIO)
#define PB11MFP_EADC0_CH11		NVT_PINMUX('B', 11, SYS_GPB_MFPH_PB11MFP_EADC0_CH11)
#define PB11MFP_EBI_ADR16		NVT_PINMUX('B', 11, SYS_GPB_MFPH_PB11MFP_EBI_ADR16)
#define PB11MFP_UART4_TXD		NVT_PINMUX('B', 11, SYS_GPB_MFPH_PB11MFP_UART4_TXD)
#define PB11MFP_I2C1_SCL		NVT_PINMUX('B', 11, SYS_GPB_MFPH_PB11MFP_I2C1_SCL)
#define PB11MFP_CAN0_TXD		NVT_PINMUX('B', 11, SYS_GPB_MFPH_PB11MFP_CAN0_TXD)
#define PB11MFP_SPI0_I2SMCLK		NVT_PINMUX('B', 11, SYS_GPB_MFPH_PB11MFP_SPI0_I2SMCLK)
#define PB11MFP_BPWM1_CH0		NVT_PINMUX('B', 11, SYS_GPB_MFPH_PB11MFP_BPWM1_CH0)
#define PB11MFP_SPI3_CLK		NVT_PINMUX('B', 11, SYS_GPB_MFPH_PB11MFP_SPI3_CLK)
#define PB12MFP_GPIO		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_GPIO)
#define PB12MFP_ACMP0_P2		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_ACMP0_P2)
#define PB12MFP_ACMP1_P2		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_ACMP1_P2)
#define PB12MFP_DAC0_OUT		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_DAC0_OUT)
#define PB12MFP_EADC0_CH12		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_EADC0_CH12)
#define PB12MFP_EBI_AD15		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_EBI_AD15)
#define PB12MFP_SC1_CLK		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_SC1_CLK)
#define PB12MFP_SPI0_MOSI		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_SPI0_MOSI)
#define PB12MFP_USCI0_CLK		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_USCI0_CLK)
#define PB12MFP_UART0_RXD		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_UART0_RXD)
#define PB12MFP_I2C2_SDA		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_I2C2_SDA)
#define PB12MFP_EPWM1_CH3		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_EPWM1_CH3)
#define PB12MFP_TM3_EXT		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_TM3_EXT)
#define PB12MFP_TM5_EXT		NVT_PINMUX('B', 12, SYS_GPB_MFPH_PB12MFP_TM5_EXT)
#define PB13MFP_GPIO		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_GPIO)
#define PB13MFP_ACMP0_P3		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_ACMP0_P3)
#define PB13MFP_ACMP1_P3		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_ACMP1_P3)
#define PB13MFP_DAC1_OUT		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_DAC1_OUT)
#define PB13MFP_EADC0_CH13		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_EADC0_CH13)
#define PB13MFP_EBI_AD14		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_EBI_AD14)
#define PB13MFP_SC1_DAT		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_SC1_DAT)
#define PB13MFP_SPI0_MISO		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_SPI0_MISO)
#define PB13MFP_USCI0_DAT0		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_USCI0_DAT0)
#define PB13MFP_UART0_TXD		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_UART0_TXD)
#define PB13MFP_I2C2_SCL		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_I2C2_SCL)
#define PB13MFP_EPWM1_CH2		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_EPWM1_CH2)
#define PB13MFP_TM2_EXT		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_TM2_EXT)
#define PB13MFP_TM4_EXT		NVT_PINMUX('B', 13, SYS_GPB_MFPH_PB13MFP_TM4_EXT)
#define PB14MFP_GPIO		NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_GPIO)
#define PB14MFP_EADC0_CH14		NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_EADC0_CH14)
#define PB14MFP_EBI_AD13		NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_EBI_AD13)
#define PB14MFP_SC1_RST		NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_SC1_RST)
#define PB14MFP_SPI0_CLK		NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_SPI0_CLK)
#define PB14MFP_USCI0_DAT1		NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_USCI0_DAT1)
#define PB14MFP_UART3_RXD		NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_UART3_RXD)
#define PB14MFP_I2C2_SMBSUS		NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_I2C2_SMBSUS)
#define PB14MFP_EPWM0_BRAKE1		NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_EPWM0_BRAKE1)
#define PB14MFP_EPWM1_CH1		NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_EPWM1_CH1)
#define PB14MFP_TM1_EXT		NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_TM1_EXT)
#define PB14MFP_CLKO		NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_CLKO)
#define PB14MFP_USB_VBUS_ST		NVT_PINMUX('B', 14, SYS_GPB_MFPH_PB14MFP_USB_VBUS_ST)
#define PB15MFP_GPIO		NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_GPIO)
#define PB15MFP_EADC0_CH15		NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_EADC0_CH15)
#define PB15MFP_EBI_AD12		NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_EBI_AD12)
#define PB15MFP_SC1_PWR		NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_SC1_PWR)
#define PB15MFP_SPI0_SS		NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_SPI0_SS)
#define PB15MFP_USCI0_CTL1		NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_USCI0_CTL1)
#define PB15MFP_UART3_TXD		NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_UART3_TXD)
#define PB15MFP_I2C2_SMBAL		NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_I2C2_SMBAL)
#define PB15MFP_EPWM1_CH0		NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_EPWM1_CH0)
#define PB15MFP_TM0_EXT		NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_TM0_EXT)
#define PB15MFP_USB_VBUS_EN		NVT_PINMUX('B', 15, SYS_GPB_MFPH_PB15MFP_USB_VBUS_EN)
#define PC0MFP_GPIO		NVT_PINMUX('C', 0, SYS_GPC_MFPL_PC0MFP_GPIO)
#define PC0MFP_EBI_AD0		NVT_PINMUX('C', 0, SYS_GPC_MFPL_PC0MFP_EBI_AD0)
#define PC0MFP_QSPI0_MOSI0		NVT_PINMUX('C', 0, SYS_GPC_MFPL_PC0MFP_QSPI0_MOSI0)
#define PC0MFP_SC1_CLK		NVT_PINMUX('C', 0, SYS_GPC_MFPL_PC0MFP_SC1_CLK)
#define PC0MFP_I2S0_LRCK		NVT_PINMUX('C', 0, SYS_GPC_MFPL_PC0MFP_I2S0_LRCK)
#define PC0MFP_SPI1_SS		NVT_PINMUX('C', 0, SYS_GPC_MFPL_PC0MFP_SPI1_SS)
#define PC0MFP_UART2_RXD		NVT_PINMUX('C', 0, SYS_GPC_MFPL_PC0MFP_UART2_RXD)
#define PC0MFP_I2C0_SDA		NVT_PINMUX('C', 0, SYS_GPC_MFPL_PC0MFP_I2C0_SDA)
#define PC0MFP_EPWM1_CH5		NVT_PINMUX('C', 0, SYS_GPC_MFPL_PC0MFP_EPWM1_CH5)
#define PC0MFP_LCD_COM0		NVT_PINMUX('C', 0, SYS_GPC_MFPL_PC0MFP_LCD_COM0)
#define PC0MFP_ACMP1_O		NVT_PINMUX('C', 0, SYS_GPC_MFPL_PC0MFP_ACMP1_O)
#define PC1MFP_GPIO		NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_GPIO)
#define PC1MFP_EBI_AD1		NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_EBI_AD1)
#define PC1MFP_QSPI0_MISO0		NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_QSPI0_MISO0)
#define PC1MFP_SC1_DAT		NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_SC1_DAT)
#define PC1MFP_I2S0_DO		NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_I2S0_DO)
#define PC1MFP_SPI1_CLK		NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_SPI1_CLK)
#define PC1MFP_UART2_TXD		NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_UART2_TXD)
#define PC1MFP_I2C0_SCL		NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_I2C0_SCL)
#define PC1MFP_EPWM1_CH4		NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_EPWM1_CH4)
#define PC1MFP_LCD_COM1		NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_LCD_COM1)
#define PC1MFP_ACMP0_O		NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_ACMP0_O)
#define PC1MFP_EADC0_ST		NVT_PINMUX('C', 1, SYS_GPC_MFPL_PC1MFP_EADC0_ST)
#define PC2MFP_GPIO		NVT_PINMUX('C', 2, SYS_GPC_MFPL_PC2MFP_GPIO)
#define PC2MFP_EBI_AD2		NVT_PINMUX('C', 2, SYS_GPC_MFPL_PC2MFP_EBI_AD2)
#define PC2MFP_QSPI0_CLK		NVT_PINMUX('C', 2, SYS_GPC_MFPL_PC2MFP_QSPI0_CLK)
#define PC2MFP_SC1_RST		NVT_PINMUX('C', 2, SYS_GPC_MFPL_PC2MFP_SC1_RST)
#define PC2MFP_I2S0_DI		NVT_PINMUX('C', 2, SYS_GPC_MFPL_PC2MFP_I2S0_DI)
#define PC2MFP_SPI1_MOSI		NVT_PINMUX('C', 2, SYS_GPC_MFPL_PC2MFP_SPI1_MOSI)
#define PC2MFP_I2C0_SMBSUS		NVT_PINMUX('C', 2, SYS_GPC_MFPL_PC2MFP_I2C0_SMBSUS)
#define PC2MFP_UART3_RXD		NVT_PINMUX('C', 2, SYS_GPC_MFPL_PC2MFP_UART3_RXD)
#define PC2MFP_EPWM1_CH3		NVT_PINMUX('C', 2, SYS_GPC_MFPL_PC2MFP_EPWM1_CH3)
#define PC2MFP_LCD_COM2		NVT_PINMUX('C', 2, SYS_GPC_MFPL_PC2MFP_LCD_COM2)
#define PC3MFP_GPIO		NVT_PINMUX('C', 3, SYS_GPC_MFPL_PC3MFP_GPIO)
#define PC3MFP_EBI_AD3		NVT_PINMUX('C', 3, SYS_GPC_MFPL_PC3MFP_EBI_AD3)
#define PC3MFP_QSPI0_SS		NVT_PINMUX('C', 3, SYS_GPC_MFPL_PC3MFP_QSPI0_SS)
#define PC3MFP_SC1_PWR		NVT_PINMUX('C', 3, SYS_GPC_MFPL_PC3MFP_SC1_PWR)
#define PC3MFP_I2S0_MCLK		NVT_PINMUX('C', 3, SYS_GPC_MFPL_PC3MFP_I2S0_MCLK)
#define PC3MFP_SPI1_MISO		NVT_PINMUX('C', 3, SYS_GPC_MFPL_PC3MFP_SPI1_MISO)
#define PC3MFP_I2C0_SMBAL		NVT_PINMUX('C', 3, SYS_GPC_MFPL_PC3MFP_I2C0_SMBAL)
#define PC3MFP_UART3_TXD		NVT_PINMUX('C', 3, SYS_GPC_MFPL_PC3MFP_UART3_TXD)
#define PC3MFP_EPWM1_CH2		NVT_PINMUX('C', 3, SYS_GPC_MFPL_PC3MFP_EPWM1_CH2)
#define PC3MFP_LCD_COM3		NVT_PINMUX('C', 3, SYS_GPC_MFPL_PC3MFP_LCD_COM3)
#define PC4MFP_GPIO		NVT_PINMUX('C', 4, SYS_GPC_MFPL_PC4MFP_GPIO)
#define PC4MFP_EBI_AD4		NVT_PINMUX('C', 4, SYS_GPC_MFPL_PC4MFP_EBI_AD4)
#define PC4MFP_QSPI0_MOSI1		NVT_PINMUX('C', 4, SYS_GPC_MFPL_PC4MFP_QSPI0_MOSI1)
#define PC4MFP_I2S0_BCLK		NVT_PINMUX('C', 4, SYS_GPC_MFPL_PC4MFP_I2S0_BCLK)
#define PC4MFP_SPI1_I2SMCLK		NVT_PINMUX('C', 4, SYS_GPC_MFPL_PC4MFP_SPI1_I2SMCLK)
#define PC4MFP_UART2_RXD		NVT_PINMUX('C', 4, SYS_GPC_MFPL_PC4MFP_UART2_RXD)
#define PC4MFP_I2C1_SDA		NVT_PINMUX('C', 4, SYS_GPC_MFPL_PC4MFP_I2C1_SDA)
#define PC4MFP_CAN0_RXD		NVT_PINMUX('C', 4, SYS_GPC_MFPL_PC4MFP_CAN0_RXD)
#define PC4MFP_UART4_RXD		NVT_PINMUX('C', 4, SYS_GPC_MFPL_PC4MFP_UART4_RXD)
#define PC4MFP_EPWM1_CH1		NVT_PINMUX('C', 4, SYS_GPC_MFPL_PC4MFP_EPWM1_CH1)
#define PC4MFP_LCD_SEG16		NVT_PINMUX('C', 4, SYS_GPC_MFPL_PC4MFP_LCD_SEG16)
#define PC4MFP_LCD_COM4		NVT_PINMUX('C', 4, SYS_GPC_MFPL_PC4MFP_LCD_COM4)
#define PC4MFP_LCD_SEG43		NVT_PINMUX('C', 4, SYS_GPC_MFPL_PC4MFP_LCD_SEG43)
#define PC5MFP_GPIO		NVT_PINMUX('C', 5, SYS_GPC_MFPL_PC5MFP_GPIO)
#define PC5MFP_EBI_AD5		NVT_PINMUX('C', 5, SYS_GPC_MFPL_PC5MFP_EBI_AD5)
#define PC5MFP_QSPI0_MISO1		NVT_PINMUX('C', 5, SYS_GPC_MFPL_PC5MFP_QSPI0_MISO1)
#define PC5MFP_UART2_TXD		NVT_PINMUX('C', 5, SYS_GPC_MFPL_PC5MFP_UART2_TXD)
#define PC5MFP_I2C1_SCL		NVT_PINMUX('C', 5, SYS_GPC_MFPL_PC5MFP_I2C1_SCL)
#define PC5MFP_CAN0_TXD		NVT_PINMUX('C', 5, SYS_GPC_MFPL_PC5MFP_CAN0_TXD)
#define PC5MFP_UART4_TXD		NVT_PINMUX('C', 5, SYS_GPC_MFPL_PC5MFP_UART4_TXD)
#define PC5MFP_EPWM1_CH0		NVT_PINMUX('C', 5, SYS_GPC_MFPL_PC5MFP_EPWM1_CH0)
#define PC5MFP_LCD_SEG15		NVT_PINMUX('C', 5, SYS_GPC_MFPL_PC5MFP_LCD_SEG15)
#define PC5MFP_LCD_COM5		NVT_PINMUX('C', 5, SYS_GPC_MFPL_PC5MFP_LCD_COM5)
#define PC5MFP_LCD_SEG42		NVT_PINMUX('C', 5, SYS_GPC_MFPL_PC5MFP_LCD_SEG42)
#define PC6MFP_GPIO		NVT_PINMUX('C', 6, SYS_GPC_MFPL_PC6MFP_GPIO)
#define PC6MFP_EBI_AD8		NVT_PINMUX('C', 6, SYS_GPC_MFPL_PC6MFP_EBI_AD8)
#define PC6MFP_SPI1_MOSI		NVT_PINMUX('C', 6, SYS_GPC_MFPL_PC6MFP_SPI1_MOSI)
#define PC6MFP_UART4_RXD		NVT_PINMUX('C', 6, SYS_GPC_MFPL_PC6MFP_UART4_RXD)
#define PC6MFP_SC2_RST		NVT_PINMUX('C', 6, SYS_GPC_MFPL_PC6MFP_SC2_RST)
#define PC6MFP_I2C1_SMBSUS		NVT_PINMUX('C', 6, SYS_GPC_MFPL_PC6MFP_I2C1_SMBSUS)
#define PC6MFP_EPWM1_CH3		NVT_PINMUX('C', 6, SYS_GPC_MFPL_PC6MFP_EPWM1_CH3)
#define PC6MFP_BPWM1_CH1		NVT_PINMUX('C', 6, SYS_GPC_MFPL_PC6MFP_BPWM1_CH1)
#define PC6MFP_LCD_SEG9		NVT_PINMUX('C', 6, SYS_GPC_MFPL_PC6MFP_LCD_SEG9)
#define PC6MFP_TM1		NVT_PINMUX('C', 6, SYS_GPC_MFPL_PC6MFP_TM1)
#define PC6MFP_INT2		NVT_PINMUX('C', 6, SYS_GPC_MFPL_PC6MFP_INT2)
#define PC7MFP_GPIO		NVT_PINMUX('C', 7, SYS_GPC_MFPL_PC7MFP_GPIO)
#define PC7MFP_EBI_AD9		NVT_PINMUX('C', 7, SYS_GPC_MFPL_PC7MFP_EBI_AD9)
#define PC7MFP_SPI1_MISO		NVT_PINMUX('C', 7, SYS_GPC_MFPL_PC7MFP_SPI1_MISO)
#define PC7MFP_UART4_TXD		NVT_PINMUX('C', 7, SYS_GPC_MFPL_PC7MFP_UART4_TXD)
#define PC7MFP_SC2_PWR		NVT_PINMUX('C', 7, SYS_GPC_MFPL_PC7MFP_SC2_PWR)
#define PC7MFP_I2C1_SMBAL		NVT_PINMUX('C', 7, SYS_GPC_MFPL_PC7MFP_I2C1_SMBAL)
#define PC7MFP_EPWM1_CH2		NVT_PINMUX('C', 7, SYS_GPC_MFPL_PC7MFP_EPWM1_CH2)
#define PC7MFP_BPWM1_CH0		NVT_PINMUX('C', 7, SYS_GPC_MFPL_PC7MFP_BPWM1_CH0)
#define PC7MFP_LCD_SEG10		NVT_PINMUX('C', 7, SYS_GPC_MFPL_PC7MFP_LCD_SEG10)
#define PC7MFP_TM0		NVT_PINMUX('C', 7, SYS_GPC_MFPL_PC7MFP_TM0)
#define PC7MFP_INT3		NVT_PINMUX('C', 7, SYS_GPC_MFPL_PC7MFP_INT3)
#define PD1MFP_GPIO		NVT_PINMUX('D', 1, SYS_GPD_MFPL_PD1MFP_GPIO)
#define PD1MFP_EBI_AD12		NVT_PINMUX('D', 1, SYS_GPD_MFPL_PD1MFP_EBI_AD12)
#define PD1MFP_USCI0_DAT0		NVT_PINMUX('D', 1, SYS_GPD_MFPL_PD1MFP_USCI0_DAT0)
#define PD1MFP_SPI0_MISO		NVT_PINMUX('D', 1, SYS_GPD_MFPL_PD1MFP_SPI0_MISO)
#define PD1MFP_UART3_TXD		NVT_PINMUX('D', 1, SYS_GPD_MFPL_PD1MFP_UART3_TXD)
#define PD1MFP_I2C2_SCL		NVT_PINMUX('D', 1, SYS_GPD_MFPL_PD1MFP_I2C2_SCL)
#define PD1MFP_SC2_DAT		NVT_PINMUX('D', 1, SYS_GPD_MFPL_PD1MFP_SC2_DAT)
#define PD1MFP_LCD_SEG0		NVT_PINMUX('D', 1, SYS_GPD_MFPL_PD1MFP_LCD_SEG0)
#define PD2MFP_GPIO		NVT_PINMUX('D', 2, SYS_GPD_MFPL_PD2MFP_GPIO)
#define PD2MFP_EBI_AD11		NVT_PINMUX('D', 2, SYS_GPD_MFPL_PD2MFP_EBI_AD11)
#define PD2MFP_USCI0_DAT1		NVT_PINMUX('D', 2, SYS_GPD_MFPL_PD2MFP_USCI0_DAT1)
#define PD2MFP_SPI0_CLK		NVT_PINMUX('D', 2, SYS_GPD_MFPL_PD2MFP_SPI0_CLK)
#define PD2MFP_SC2_RST		NVT_PINMUX('D', 2, SYS_GPD_MFPL_PD2MFP_SC2_RST)
#define PD2MFP_UART0_RXD		NVT_PINMUX('D', 2, SYS_GPD_MFPL_PD2MFP_UART0_RXD)
#define PD2MFP_LCD_SEG1		NVT_PINMUX('D', 2, SYS_GPD_MFPL_PD2MFP_LCD_SEG1)
#define PD3MFP_GPIO		NVT_PINMUX('D', 3, SYS_GPD_MFPL_PD3MFP_GPIO)
#define PD3MFP_EBI_AD10		NVT_PINMUX('D', 3, SYS_GPD_MFPL_PD3MFP_EBI_AD10)
#define PD3MFP_USCI0_CTL1		NVT_PINMUX('D', 3, SYS_GPD_MFPL_PD3MFP_USCI0_CTL1)
#define PD3MFP_SPI0_SS		NVT_PINMUX('D', 3, SYS_GPD_MFPL_PD3MFP_SPI0_SS)
#define PD3MFP_USCI1_CTL0		NVT_PINMUX('D', 3, SYS_GPD_MFPL_PD3MFP_USCI1_CTL0)
#define PD3MFP_SC2_PWR		NVT_PINMUX('D', 3, SYS_GPD_MFPL_PD3MFP_SC2_PWR)
#define PD3MFP_UART0_TXD		NVT_PINMUX('D', 3, SYS_GPD_MFPL_PD3MFP_UART0_TXD)
#define PD3MFP_LCD_SEG2		NVT_PINMUX('D', 3, SYS_GPD_MFPL_PD3MFP_LCD_SEG2)
#define PF0MFP_GPIO		NVT_PINMUX('F', 0, SYS_GPF_MFPL_PF0MFP_GPIO)
#define PF0MFP_UART1_TXD		NVT_PINMUX('F', 0, SYS_GPF_MFPL_PF0MFP_UART1_TXD)
#define PF0MFP_I2C1_SCL		NVT_PINMUX('F', 0, SYS_GPF_MFPL_PF0MFP_I2C1_SCL)
#define PF0MFP_UART0_TXD		NVT_PINMUX('F', 0, SYS_GPF_MFPL_PF0MFP_UART0_TXD)
#define PF0MFP_BPWM1_CH0		NVT_PINMUX('F', 0, SYS_GPF_MFPL_PF0MFP_BPWM1_CH0)
#define PF0MFP_ICE_DAT		NVT_PINMUX('F', 0, SYS_GPF_MFPL_PF0MFP_ICE_DAT)
#define PF1MFP_GPIO		NVT_PINMUX('F', 1, SYS_GPF_MFPL_PF1MFP_GPIO)
#define PF1MFP_UART1_RXD		NVT_PINMUX('F', 1, SYS_GPF_MFPL_PF1MFP_UART1_RXD)
#define PF1MFP_I2C1_SDA		NVT_PINMUX('F', 1, SYS_GPF_MFPL_PF1MFP_I2C1_SDA)
#define PF1MFP_UART0_RXD		NVT_PINMUX('F', 1, SYS_GPF_MFPL_PF1MFP_UART0_RXD)
#define PF1MFP_BPWM1_CH1		NVT_PINMUX('F', 1, SYS_GPF_MFPL_PF1MFP_BPWM1_CH1)
#define PF1MFP_ICE_CLK		NVT_PINMUX('F', 1, SYS_GPF_MFPL_PF1MFP_ICE_CLK)
#define PF2MFP_GPIO		NVT_PINMUX('F', 2, SYS_GPF_MFPL_PF2MFP_GPIO)
#define PF2MFP_UART0_RXD		NVT_PINMUX('F', 2, SYS_GPF_MFPL_PF2MFP_UART0_RXD)
#define PF2MFP_I2C0_SDA		NVT_PINMUX('F', 2, SYS_GPF_MFPL_PF2MFP_I2C0_SDA)
#define PF2MFP_QSPI0_CLK		NVT_PINMUX('F', 2, SYS_GPF_MFPL_PF2MFP_QSPI0_CLK)
#define PF2MFP_XT1_OUT		NVT_PINMUX('F', 2, SYS_GPF_MFPL_PF2MFP_XT1_OUT)
#define PF2MFP_BPWM1_CH1		NVT_PINMUX('F', 2, SYS_GPF_MFPL_PF2MFP_BPWM1_CH1)
#define PF3MFP_GPIO		NVT_PINMUX('F', 3, SYS_GPF_MFPL_PF3MFP_GPIO)
#define PF3MFP_UART0_TXD		NVT_PINMUX('F', 3, SYS_GPF_MFPL_PF3MFP_UART0_TXD)
#define PF3MFP_I2C0_SCL		NVT_PINMUX('F', 3, SYS_GPF_MFPL_PF3MFP_I2C0_SCL)
#define PF3MFP_XT1_IN		NVT_PINMUX('F', 3, SYS_GPF_MFPL_PF3MFP_XT1_IN)
#define PF3MFP_BPWM1_CH0		NVT_PINMUX('F', 3, SYS_GPF_MFPL_PF3MFP_BPWM1_CH0)
#define PF4MFP_GPIO		NVT_PINMUX('F', 4, SYS_GPF_MFPL_PF4MFP_GPIO)
#define PF4MFP_UART2_TXD		NVT_PINMUX('F', 4, SYS_GPF_MFPL_PF4MFP_UART2_TXD)
#define PF4MFP_EPWM0_CH1		NVT_PINMUX('F', 4, SYS_GPF_MFPL_PF4MFP_EPWM0_CH1)
#define PF4MFP_BPWM0_CH5		NVT_PINMUX('F', 4, SYS_GPF_MFPL_PF4MFP_BPWM0_CH5)
#define PF4MFP_X32_OUT		NVT_PINMUX('F', 4, SYS_GPF_MFPL_PF4MFP_X32_OUT)
#define PF5MFP_GPIO		NVT_PINMUX('F', 5, SYS_GPF_MFPL_PF5MFP_GPIO)
#define PF5MFP_UART2_RXD		NVT_PINMUX('F', 5, SYS_GPF_MFPL_PF5MFP_UART2_RXD)
#define PF5MFP_EPWM0_CH0		NVT_PINMUX('F', 5, SYS_GPF_MFPL_PF5MFP_EPWM0_CH0)
#define PF5MFP_BPWM0_CH4		NVT_PINMUX('F', 5, SYS_GPF_MFPL_PF5MFP_BPWM0_CH4)
#define PF5MFP_EPWM0_SYNC_OUT		NVT_PINMUX('F', 5, SYS_GPF_MFPL_PF5MFP_EPWM0_SYNC_OUT)
#define PF5MFP_X32_IN		NVT_PINMUX('F', 5, SYS_GPF_MFPL_PF5MFP_X32_IN)
#define PF5MFP_EADC0_ST		NVT_PINMUX('F', 5, SYS_GPF_MFPL_PF5MFP_EADC0_ST)
#define PF6MFP_GPIO		NVT_PINMUX('F', 6, SYS_GPF_MFPL_PF6MFP_GPIO)
#define PF6MFP_EBI_ADR19		NVT_PINMUX('F', 6, SYS_GPF_MFPL_PF6MFP_EBI_ADR19)
#define PF6MFP_SC0_CLK		NVT_PINMUX('F', 6, SYS_GPF_MFPL_PF6MFP_SC0_CLK)
#define PF6MFP_I2S0_LRCK		NVT_PINMUX('F', 6, SYS_GPF_MFPL_PF6MFP_I2S0_LRCK)
#define PF6MFP_SPI0_MOSI		NVT_PINMUX('F', 6, SYS_GPF_MFPL_PF6MFP_SPI0_MOSI)
#define PF6MFP_UART4_RXD		NVT_PINMUX('F', 6, SYS_GPF_MFPL_PF6MFP_UART4_RXD)
#define PF6MFP_SPI3_I2SMCLK		NVT_PINMUX('F', 6, SYS_GPF_MFPL_PF6MFP_SPI3_I2SMCLK)
#define PF6MFP_TAMPER0		NVT_PINMUX('F', 6, SYS_GPF_MFPL_PF6MFP_TAMPER0)
